{
  "todos": [
    {
      "id": "1",
      "title": "Example Todo",
      "content": "This is an example todo item",
      "completed": false
    },
    {
      "id": "20b9",
      "title": "JavaScript basics",
      "content": "JavaScript is a programming language that adds interactivity to your website. This happens in games, in the behavior of responses when buttons are pressed or with data entry on forms; with dynamic styling; with animation, etc. This article helps you get started with JavaScript and furthers your understanding of what is possible.\n\nWhat is JavaScript?\nJavaScript is a powerful programming language that can add interactivity to a website. It was invented by Brendan Eich.\n\nJavaScript is versatile and beginner-friendly. With more experience, you'll be able to create games, animated 2D and 3D graphics, comprehensive database-driven apps, and much more!\n\nJavaScript itself is relatively compact, yet very flexible. Developers have written a variety of tools on top of the core JavaScript language, unlocking a vast amount of functionality with minimum effort. These include:\n\nBrowser Application Programming Interfaces (APIs) built into web browsers, providing functionality such as dynamically creating HTML and setting CSS styles; collecting and manipulating a video stream from a user's webcam, or generating 3D graphics and audio samples.\nThird-party APIs that allow developers to incorporate functionality in sites from other content providers, such as Disqus or Facebook.\nThird-party frameworks and libraries that you can apply to HTML to accelerate the work of building sites and applications.",
      "completed": true
    },
    {
      "id": "931b",
      "title": "Try app",
      "content": "Trying new local llm api to connect it to aider ",
      "completed": true
    },
    {
      "id": "7271",
      "title": "Try chess",
      "content": "try chess",
      "completed": true
    },
    {
      "id": "7c12",
      "title": "Quick Start",
      "content": "The markup syntax you’ve seen above is called JSX. It is optional, but most React projects use JSX for its convenience. All of the tools we recommend for local development support JSX out of the box.\n\nJSX is stricter than HTML. You have to close tags like <br />. Your component also can’t return multiple JSX tags. You have to wrap them into a shared parent, like a <div>...</div> or an empty <>...</> wrapper:",
      "completed": false
    },
    {
      "id": "da10",
      "title": "Judas",
      "content": "Oh, whoa-whoa, oh-oh\nI'm in love with Judas, Judas\nOh-oh-oh-oh-oh\nI'm in love with Judas, Judas\nJudas, Juda-ah-ah, Judas, Juda-ah-ah\nJudas, Juda-ah-ah, Judas, Gaga\nJudas, Juda-ah-ah, Judas, Juda-ah-ah\nJudas, Juda-ah-ah, Judas, Gaga",
      "completed": false
    },
    {
      "id": "6837",
      "title": "Cook Lasagna",
      "content": "Home » Pasta Recipes » Italian Baked Pasta\nAuthentic Italian Lasagna Bolognese Recipe | Lasagne alla Bolognese\nPublished: Feb 15, 2021 · Modified: Apr 2, 2024 by Silvana Nava · This post may contain affiliate links\n\n Jump to Recipe\nThis here is the authentic Italian Lasagna Bolognese recipe (Lasagne alla Bolognese), the one you would eat in Italy in the best Italian restaurants.\n\nIt's the authentic recipe born in the city of Bologna, WITHOUT MOZZARELLA. Oh yes, because, contrary to popular belief, the authentic classic recipe of Lasagna Bolognese does NOT want mozzarella.\n\nlasagna bolognese recipe\n\n\nLasagna with mozzarella is a VARIANT of this classic Lasagna recipe and you can find it mainly in southern Italy, often together with ricotta.\n\nThe authentic traditional recipe of lasagna Bolognese is made up of three main preparations: fresh egg pasta (Lasagna Noodles), Bolognese Sauce (Ragu alla Bolognese) and bechamel.\n\nNow let's see together how to make Lasagna Bolognese classic Italian",
      "completed": false
    },
    {
      "id": "0a0b",
      "title": "pizza recipe",
      "content": "Pizza dough is a yeasted dough that requires active dry yeast. Make sure the check the expiration date on the yeast package! Yeast that is too old may be dead and won't work.\n\nAlso, if the yeast does not begin to foam or bloom within 10 minutes of being added to the water in Step 1 of Making the Pizza Dough, it is probably dead. You'll need to start over with new, active yeast.\n\nHow to Proof Yeast",
      "completed": false
    },
    {
      "id": "e980",
      "title": "How To Measure Flour for This Pizza Dough Recipe",
      "content": "Cup measurements can vary depending on how you are scooping the flour (we fluff the flour, lightly scoop it, and level with a knife). So I recommend using a kitchen scale to measure out the flour amounts by weight. This is the only way you'll get a consistently accurate measurement.",
      "completed": false
    },
    {
      "id": "abfa",
      "title": "Another Recipe",
      "content": "Begin by preparing the ragù (meat sauce). First, cut the pancetta into 1/4\" cubes. Chop the cubes and sauté them in a pan. In another pan, add 3 Tbsp. oil or butter, the celery, carrot, and onion, and cook until soft. Add the ground beef and cook until well browned, 25-30 minutes. Add the wine and stir until it evaporates. Add the tomato purée, cover, and simmer slowly for around two hours, adding broth as needed. When nearly done, add 1/2 cup milk to cut the acidity of the tomatoes. Season with salt and pepper to taste.",
      "completed": false
    },
    {
      "id": "4271",
      "title": "here",
      "content": "here we are, lets try super long test with just printing it by smashing keyboard",
      "completed": false
    },
    {
      "id": "c91b",
      "title": "One major threat is driving tourists away from this beautiful Italian city",
      "content": "Building in suburbia is one thing, but creating an off-grid home in the wilderness far away from civilization requires creative thinking and courage. From a treetop retreat and a desert hideaway to a converted observation tower, we've rounded up the world's most secluded, self-sufficient properties that offer a welcome escape from the rat race.",
      "completed": false
    },
    {
      "id": "3041",
      "title": "laralara",
      "content": "lalalalaaaaaaaaaalaaaaaaaaaaaaaaaaaaaaalllllllllllllllllllallllllllllalllllllllllllllllllallllllaaaaaaaaaaaaaaaaaaaaaaalllllllllllllllaaaaaaaaaaaaaaaaaaalaaaaaaaaaaaaaaaa",
      "completed": true
    },
    {
      "id": "3a76",
      "title": "episodes",
      "content": "Last summer, fans got a glimpse of Myers in character in pictures of the cast filming, but now the BBC have released some exciting first-look images of the show.\n\nThe new photos have been shared on X, formerly Twitter, by the broadcaster, with the caption: \"One step closer to solving the #AGGGTM mystery.\"\n\nIn one photo, Myers can be seen bringing much-loved character Pip to life, standing in front of a detailed evidence board full of her detective work – with maps, newspaper cuttings and written timelines.",
      "completed": false
    },
    {
      "id": "9b7b",
      "title": "some again",
      "content": "cowkdmopkwdposcjo cdplpsdlpckwdpksd wecplwepckwpekcpk  wpedeclwpeckwepkcpwdk     pwedkc[ckwc[wevkcvwe[\ncwc,kweoekpwkpwkc['wee[pcvlkwe[kv[vpewk[vpkwee[dpcvkkdc[pewk[vpkew[dk[pqk[pwvk[pvewkv[pvek[ec\ncokwkw[eoekcowekc[pwkekpvle[pvk[pewkv[oek[ovk[eofkv[pekf[vpke[pvkef[pvk[epkv[efkv[pefd\nvefeovkpoekvpevpokefpovjefpovkoefjvpoqjpovjefpovjpemv;ksdmLVLJLVJOERVJEJPiv\nolvjepvjpefavjervpieahrvlehnv;laehvvoruvjoaierjapreajvoennn;vrvfiavjeoivaenoienoi",
      "completed": false
    },
    {
      "id": "aea1",
      "title": "look",
      "content": "There is also a picture of Pip on a bed alongside the show’s other central",
      "completed": false
    }
  ],
  "comments": [
    {
      "id": "1",
      "todoId": 1,
      "text": "i tryed to edit this comment."
    },
    {
      "id": "fed3",
      "todoId": "1",
      "text": "It is editing?"
    },
    {
      "id": "e483",
      "todoId": "7271",
      "text": "i dont belive you"
    },
    {
      "id": "2104",
      "todoId": "7271",
      "text": "says who?"
    },
    {
      "id": "d24c",
      "todoId": "6837",
      "text": "will be interesting to see how"
    },
    {
      "id": "804d",
      "todoId": "3041",
      "text": "alalallaalla"
    }
  ],
  "scripts": []
}